Repository: alionetasso/doc-sle-translations
Catalog: */po/64bit_issues.*.po
Languages: fr

# _
source: translator-credits
fr: Sébastien POHER <sogal@opensuse.org>, 2019

source: 32-Bit and 64-Bit Applications in a 64-Bit System Environment
fr: Applications 32 et 64 bits dans un environnement 64 bits

source: <phrase role="productname"><phrase os="osuse">openSUSE® Leap</phrase><phrase os="sles">SUSE® Linux Enterprise Server</phrase><phrase os="sled">SUSE® Linux Enterprise Desktop</phrase></phrase> is available for <phrase os="sles">several</phrase> 64-bit platforms. Developers have not ported all 32-bit applications to 64-bit systems. But <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> supports 32-bit application use in 64-bit system environments. This chapter offers a brief overview of 32-bit support implementation on 64-bit <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> platforms.
fr: <phrase role="productname"><phrase os="osuse">openSUSE® Leap</phrase><phrase os="sles">SUSE® Linux Enterprise Server</phrase><phrase os="sled">SUSE® Linux Enterprise Desktop</phrase></phrase> sont disponibles pour <phrase os="sles">plusieurs</phrase> plate-formes 64 bits. Les développeurs n'ont pas porté toutes les applications 32 bits vers le système en 64 bits. Toutefois <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> prennent en charge l'utilisation d'applications 32 bit dans un environnement 64 bits. Ce chapitre offre un bref aperçu de la prise en charge du support 32 bits sur les plate-formes 64 bit <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase> et <phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>.

source: <phrase os="sles"><phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> for the 64-bit platforms POWER, IBM Z and AMD64/Intel 64</phrase><phrase os="sled;osuse"><phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> for the 64-bit platforms AMD64 and Intel 64</phrase> is designed so that existing 32-bit applications run in the 64-bit environment <quote>out-of-the-box.</quote> <phrase os="sles">The corresponding 32-bit platforms are ppc for POWER, and x86 for AMD64/Intel 64.</phrase> This support means that you can continue to use your preferred 32-bit applications without waiting for a corresponding 64-bit port to become available.<phrase os="sles"> The current POWER system runs most applications in 32-bit mode, but you can run 64-bit applications.</phrase>
fr: <phrase os="sles"><phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> pour plate-formes 64 bits POWER, IBM Z et AMD64/Intel 64</phrase><phrase os="sled;osuse"><phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">et SUSE Linux Enterprise Desktop</phrase></phrase> pour plate-formes 64 bits AMD64 et Intel 64</phrase> sont conçus pour qu'une application en 32 bits puisse s'exécuter dans l'environnement 64 bits nativement. <phrase os="sles">Les plate-formes 32 bits correspondante sont pcc pour POWER et x86 pour AMD64 et Intel 64.</phrase> Cette prise en charge signifie que vous pouvez continuer à utiliser vos applications 32 bits favorites sans avoir à attendre qu'une version 64 bits soit disponible.<phrase os="sles"> Le système POWER actuel exécute la plupart des applications en mode 32 bits mais vous pouvez lancer des applications 64 bits.</phrase>

source: No Support for Building 32-bit Applications
fr: Absence de prise en charge de la compilation d'applications 32 bits

source: <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> does not support compilation of 32-bit applications. It only offers runtime support for 32-bit binaries.
fr: <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">et SUSE Linux Enterprise Desktop</phrase></phrase> ne prend pasen charge la compilation d'applications 32 bits. Seule l'exécution desbinaires 32 bits est gérée.

source: Runtime Support
fr: Prise en charge de l'exécution

source: Conflicts Between Application Versions
fr: Conflits entre versions d'une application

source: If an application is available for both 32-bit and 64-bit environments, installing both versions may cause problems. In such cases, decide on one version to install to avoid potential runtime errors.
fr: Si une application est disponible à la fois pour les environnements 23 et 64 bits, l'installation des deux versions peut cause des problèmes. Dans un tel cas, il convient de n'installer qu'une seule version afin d'éviter des possibles erreurs au lancement.

source: An exception to this rule is PAM (pluggable authentication modules). <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> uses PAM in the authentication process as a layer that mediates between user and application. Always install both PAM versions on 64-bit operating systems that also run 32-bit applications.
fr: PAM (pluggable authentication modules) est une exception à cette règle. <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> utilise PAM au cours du processus d'authentification en tant que couche intermédiaire entre l'utilisateur et l'application. Il faut donc toujours installer les deux versions de PAM sur système 64 bits exécutant également des applications 32 bits.

source: For correct execution, every application requires a range of libraries. Unfortunately, the names are identical for the 32-bit and 64-bit versions of these libraries. They must be differentiated from each other in another way.
fr: Afin de s'exécuter correctement, chaque application requiert un certain nombre de bibliothèque. Malheureusement, les noms identiques pour les version 32 et 64 bits de ces bibliothèques. Elles doivent donc être différenciées l'une de l'autre par un autre moyen.

source: To retain compatibility with 32-bit versions, 64-bit and 32-bit libraries are stored in the same location. The 32-bit version of <filename>libc.so.6</filename> is located under <filename>/lib/libc.so.6</filename> in both 32-bit and 64-bit environments.
fr: Afin d'assurer la compatibilité avec les versions 32 bits, les bibliothèques 32 et 64 bits sont placées au même endroit. La version 32 bit de <filename>libc.so.6</filename> se trouve dans <filename>/lib/libc.so.6</filename> dans les environnements 32 ou 64 bits.

source: All 64-bit libraries and object files are located in directories called <filename>lib64</filename>. The 64-bit object files normally found under <filename>/lib</filename> and <filename>/usr/lib</filename> are now found under <filename>/lib64</filename> and <filename>/usr/lib64</filename>. This means that space is available for 32-bit libraries under <filename>/lib</filename> and <filename>/usr/lib</filename>, so the file name for both versions can remain unchanged.
fr: Toutes les bibliothèques et fichiers objet sont situés dans un répertoire nommé <filename>lib64</filename>. Les fichiers objet pour environnement 64 bits, normalement situé dans <filename>/lib</filename> et <filename>/usr/lib</filename> sont désormais placé dans <filename>/lib64</filename> et </filename>/usr/lib64</filename>. Cet emplacement est ainsi disponible pour les bibliothèques 32 bits dans <filename>/lib</filename> et <filename>/usr/lib</filename>, de telle sorte que le nom des fichiers des deux versions reste inchangé.

source: If the data content of 32-bit subdirectories under <filename>/lib</filename> does not depend on word size, they are not moved. This scheme conforms to LSB (Linux Standards Base) and FHS (File System Hierarchy Standard).
fr: Si les données d'un sous-dossier 32 bits situé sous <filename>/lib</filename> ne dépend pas de la taille du mot machine, elles ne sont pas déplacées. Cela est conforme aux standards LSB (Linux Standards Base) et FHS (File System Hierarchy Standard).

source: Kernel Specifications
fr: Caractéristiques du noyau

source: The 64-bit kernels for AMD64/Intel 64<phrase os="sles">, POWER and IBM Z</phrase> offer both a 64-bit and a 32-bit kernel ABI (application binary interface). The latter is identical to the ABI for the corresponding 32-bit kernel. This means that communication between both 32-bit and 64-bit applications with 64-bit kernels are identical.
fr: Les noyaux 64 bits pour AMD64/Intel 64<phrase os="sles">, POWER et IBM Z</phrase> fournissent une ABI (interface binaire d'application) du noyau pour 32 et 64 bits. Cette dernière est identique à l'ABI du noyau 32 bits correspondant. Cela signifie que les communications entre applications 32 ou 64 bits sur un noyau 64 bits sont identiques.
